app/Controllers/Api.php

SELECT *
FROM `user`
WHERE `username` = 'Admin'
 LIMIT 1
---
    public function login()
    {
        $Username = $this->request->getVar('username');
        $password = md5($this->request->getVar('password'));
        $model = new UserModel();
        $user = $model->where('username', $Username)->first();