app/Controllers/Caraousel.php

    public function index()
    {
        $CaraouselModel = new CaraouselModel();
        $caraousel = $CaraouselModel->findAll();
---
SELECT *
FROM `caraousel`