app/Controllers/Home.php

SELECT *
FROM `konten`
JOIN `kategori` ON `konten`.`id_kategori` = `kategori`.`id_kategori`
ORDER BY `konten`.`id_konten` DESC
SELECT *
FROM `kategori`
SELECT *
FROM `caraousel`
SELECT *
FROM `konfigurasi`
 LIMIT 1
---
    public function index()
    {
        $KontenModel = new KontenModel();
        $konten = $KontenModel->join('kategori', 'konten.id_kategori = kategori.id_kategori')->orderBy('konten.id_konten', 'DESC')->findAll();
        $KategoriModel = new KategoriModel();
        $kategori = $KategoriModel->findAll();
        $CaraouselModel = new CaraouselModel();
        $caraousel = $CaraouselModel->findAll();
        $KonfigurasiModel = new KonfigurasiModel();
        $konfigurasi = $KonfigurasiModel->first();