app/Controllers/Kategori.php

    public function index()
    {
        helper('form');
        $KategoriModel = new KategoriModel();
        $kategori = $KategoriModel->findAll();
---
SELECT *
FROM `kategori`