app/Controllers/Konfigurasi.php

SELECT *
FROM `konfigurasi`
 LIMIT 1
---
    public function index()
    {
        helper('form');
        $KonfigurasiModel = new KonfigurasiModel();
        $konfigurasi = $KonfigurasiModel->first();