app/Controllers/Konten.php

SELECT *
FROM `kategori`
SELECT *
FROM `konten`
JOIN `kategori` ON `konten`.`id_kategori` = `kategori`.`id_kategori`
ORDER BY `tanggal` DESC
---
    public function index()
    {
        $KategoriModel = new KategoriModel();
        $kategori = $KategoriModel->findAll();
        helper('form');
        $KontenModel = new KontenModel();
        $konten = $KontenModel
            ->join('kategori', 'konten.id_kategori = kategori.id_kategori')
            ->orderBy('tanggal', 'DESC')->findAll();